<template>
  <div>
    <!-- Шапка на всю ширину -->
    <div class="header-full-width">
      <div class="header-container">
        <NuxtLink to="/" class="brand-link">
          <h1 class="brand-name">Voshod</h1>
        </NuxtLink>
        <div class="header-buttons">
          <Button @click="goToHome" class="p-button-primary home-button" icon="pi pi-home" tooltip="На главную"
                  tooltipOptions="{position: 'bottom'}"/>
          <Button @click="basket" class="p-button-primary cart-button" icon="pi pi-shopping-cart" tooltip="Корзина"
                  tooltipOptions="{position: 'bottom'}"/>
        </div>
      </div>
    </div>

    <!-- Контейнер для контента оферты -->
    <div class="content-container offer-container">
      <h1 class="offer-title">Публичная оферта</h1>

      <div class="offer-content">
        <p>Настоящий документ – это публичная оферта (предложение) интернет-магазина «voshod.coor.xyz» о продаже товаров.</p>

        <h2>1. Общие положения</h2>
        <p>1.1. Настоящая публичная оферта (далее - Оферта) является официальным предложением НПД Черепанова Данилы Вячеславовича в адрес любого физического лица заключить договор розничной купли-продажи товара на Сайте дистанционным образом на условиях, определенных в настоящем Договоре и содержит все существенные условия Оферты.</p>
        <p>1.2. Заказ Покупателем товара, размещенного на Сайте, означает, что Покупатель согласен со всеми условиями настоящей Оферты, Политики конфиденциальности и Пользовательского соглашения.</p>
        <p>1.3. Сайт имеет право вносить изменения в Оферту без уведомления Покупателя.</p>
        <p>1.4. Срок действия Оферты не ограничен, если иное не указано на Сайте.</p>
        <p>1.5. Сайт предоставляет Покупателю полную и достоверную информацию о товаре/услугах, включая информацию об основных потребительских свойствах товара.</p>

        <h2>2. Предмет Оферты</h2>
        <p>2.1. Сайт обязуется передать Покупателю товар, предназначенный для личного, семейного, домашнего или иного использования, не связанного с предпринимательской деятельностью, на основании размещенных Заказов, а Покупатель обязуется принять и оплатить Товар на условиях настоящей Оферты.</p>
        <p>2.2. Наименование, цена, количество товара, а также прочие необходимые условия Оферты определяются на основании сведений, предоставленных Покупателем при оформлении заказа.</p>
        <p>2.3. Право собственности на заказанные товары переходит к Покупателю с момента фактической оплаты и передачи товара. Риск его случайной гибели или повреждения товара переходит к Покупателю с момента фактической передачи товара Покупателю.</p>

        <h2>3. Стоимость товара/услуг</h2>
        <p>3.1. Цены на товар определяются Продавцом в одностороннем бесспорном порядке и указываются на страницах интернет-магазина, расположенного по интернет-адресу: voshod.coor.xyz.</p>
        <p>3.2. Цена товара указывается в рублях Российской Федерации и не включает стоимость перевозки.</p>
        <p>3.3. Окончательная цена товара определяется последовательным действием на цену товара скидок по следующему порядку:</p>
        <p>- Акционная скидка</p>
        <p>- Скидка по промокоду</p>
        <p>3.4. Способ расчетов между Сайтом и Покупателем определяется Покупателем при оплате выбранного на сайте Товара.</p>

        <h2>4. Момент заключения Оферты</h2>
        <p>4.1. Акцептом настоящей Оферты (договора) является оформление Покупателем заказа на товар в соответствии с условиями настоящей Оферты;</p>
        <p>4.2. Акцентируя настоящую Оферту, Покупатель выражает согласие в том, что:</p>
        <p>- регистрационные данные (в том числе персональные данные) указаны им добровольно;</p>
        <p>- регистрационные данные (в том числе персональные данные) передаются в электронной форме по каналам связи сети «Интернет»;</p>
        <p>- регистрационные данные (в том числе персональные данные) переданы Сайту для реализации целей, указанных в настоящей Оферте, Политике конфиденциальности, Пользовательском соглашении и могут быть переданы третьим лицам для реализации целей, указанных в настоящей Оферте;</p>
        <p>- регистрационные данные (в том числе персональные данные) могут быть использованы Сайтом в целях продвижения товаров и услуг, путем осуществления прямых контактов с Покупателем с помощью каналов связи;</p>
        <p>- в целях дополнительной защиты от мошеннических действий указанные Покупателем регистрационные данные (в том числе персональные данные) могут быть переданы банку, осуществляющему транзакции по оплате оформленных заказов;</p>
        <p>- данное Покупателем согласие на обработку его регистрационных данных (в том числе персональных данных) является бессрочным и может быть отозвано Покупателем или его законным представителем, подачей письменного заявления, переданного Сайту.</p>

        <h2>5. Гарантии, возврат товара и денежных средств</h2>
        <p>5.1. Гарантийный срок на реализуемые товары составляет 30 календарный дней. Товар к обмену или возврату принимается в срок не более 14 календарных дней с момента получения посылки, если товар не был в употреблении, сохранены его товарный вид и потребительские свойства. Для оформления возврата/обмена необходимо передать товар продавцу отправив его транспортной компанией СДЭК на адрес, который можно уточнить по телефону +79222151505 или группе "Вконтакте".</p>
        <p>Данные гарантии носят дополнительный характер по сравнению с гарантиями и правами потребителя предусмотренными законодательством РФ.</p>
        <p>5.2. Возврат денежных средств осуществляется посредством возврата стоимости оплаченного товара на ту платежную систему, через которую оплата была произведена, либо по реквизитам, указанным в заявлении.</p>

        <h2>6. Доставка товара</h2>
        <p>6.1. Доставка товара Покупателю осуществляется в сроки, указанные в описании товара и в разделе ДОСТАВКА.</p>
        <p>6.2. Претензии к количеству, комплектности и виду товара принимаются в течение 3-х дней после получения.</p>

        <h2>7. Срок действия Оферты</h2>
        <p>7.1. Настоящая Оферта вступает в силу с момента ее акцепта Покупателем и действует до момента отзыва акцепта публичной Оферты.</p>

        <h2>8. Дополнительные условия</h2>
        <p>8.1. Сайт вправе переуступать либо каким-либо иным способом передавать свои права и обязанности, вытекающие из его отношений с Покупателем, третьим лицам.</p>
        <p>8.2. Сайт и предоставляемые сервисы могут временно частично или полностью недоступны по причине проведения профилактических или иных работ или по любым другим причинам технического характера. Техническая служба Сайта имеет право периодически проводить необходимые профилактические или иные работы с предварительным уведомлением Покупателей или без такового.</p>
        <p>8.3. К отношениям между Покупателем и Сайтом применяются положения Российского законодательства.</p>
        <p>8.4. В случае возникновения вопросов и претензий со стороны Покупателя он должен обратиться к Сайту по телефону или иным доступным способом. Все возникающее споры стороны будут стараться решить путем переговоров, при недостижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством РФ.</p>
        <p>8.5. Признание судом недействительности какого-либо положения настоящего Соглашения не влечет за собой недействительность остальных положений.</p>

        <h2>9. Реквизиты Сайта</h2>
        <p>НПД Черепанов Данила Вячеславович. ИНН: 665201957964</p>
        <p>Дата публикации – 05.05.2025</p>
      </div>
    </div>

    <!-- Футер -->
    <div class="footer">
      <div class="footer-container">
        <div class="footer-links">
          <NuxtLink to="/" class="footer-link">Главная</NuxtLink>
          <NuxtLink to="/offer" class="footer-link">Публичная оферта</NuxtLink>
          <NuxtLink to="/contacts" class="footer-link">Контакты</NuxtLink>
        </div>
        <div class="footer-copyright">
          © 2023 Voshod. Все права защищены.
        </div>
      </div>
    </div>
  </div>
</template>

<script setup>
import { useCart } from '~/composables/useCart.js';
import { onMounted } from 'vue';

const router = useRouter();
const cartStore = useCart();

const basket = () => {
  router.push('/cart');
};
const goToHome = () => {
  router.push('/');
};

onMounted(async () => {
  await cartStore.fetchCartProducts();
});
</script>

<style>
/* Шапка на всю ширину */
.header-full-width {
  width: 100%;
  background-color: var(--surface-section);
  border-bottom: 1px solid var(--surface-border);
}

.header-container {
  display: flex;
  justify-content: space-between;
  align-items: center;
  padding: 1rem 2rem;
  max-width: 1400px;
  margin: 0 auto;
}

.brand-name {
  font-size: 2.5rem;
  font-weight: 700;
  color: var(--text-color);
  margin: 0;
}

.brand-link {
  text-decoration: none;
  color: inherit;
}

/* Более контрастная кнопка корзины */
.cart-button {
  width: 3rem !important;
  height: 3rem !important;
  font-size: 1.2rem !important;
}

/* Контейнер для центрированного контента */
.content-container {
  max-width: 1200px;
  margin: 0 auto;
  padding: 2rem 1rem;
}

/* Стили для страницы оферты */
.offer-container {
  max-width: 900px;
}

.offer-title {
  text-align: center;
  margin-bottom: 2rem;
  font-size: 2rem;
  font-weight: 600;
}

.offer-content {
  line-height: 1.6;
}

.offer-content h2 {
  margin-top: 2rem;
  margin-bottom: 1rem;
  font-size: 1.5rem;
  font-weight: 600;
  color: var(--text-color);
}

.offer-content p {
  margin-bottom: 1rem;
  text-align: justify;
}

/* Стили для футера */
.footer {
  width: 100%;
  background-color: var(--surface-section);
  border-top: 1px solid var(--surface-border);
  margin-top: 2rem;
}

.footer-container {
  max-width: 1200px;
  margin: 0 auto;
  padding: 2rem 1rem;
  display: flex;
  flex-direction: column;
  align-items: center;
}

.footer-links {
  margin-bottom: 1rem;
  display: flex;
  gap: 1.5rem;
}

.footer-link {
  color: var(--text-color);
  text-decoration: none;
  transition: color 0.3s ease;
  font-size: 0.9rem;
}

.footer-link:hover {
  color: var(--primary-color);
  text-decoration: underline;
}

.footer-copyright {
  color: var(--text-color-secondary);
  font-size: 0.85rem;
}

/* Адаптивность для мобильных устройств */
@media (max-width: 768px) {
  .brand-name {
    font-size: 2rem;
  }

  .header-container {
    padding: 1rem;
  }

  .offer-title {
    font-size: 1.7rem;
  }

  .offer-content h2 {
    font-size: 1.3rem;
  }

  .footer-container {
    padding: 1.5rem 1rem;
  }
}
/* Контейнер для кнопок в хедере */
.header-buttons {
  display: flex;
  gap: 0.5rem;
}

/* Стиль для кнопки главной страницы */
.home-button {
  width: 3rem !important;
  height: 3rem !important;
  font-size: 1.2rem !important;
}
@media (max-width: 768px) {
  .footer-links {
    flex-direction: column;
    align-items: center;
    gap: 1rem;
  }
}
</style>